

{
    "train": {
        "text": "В каких фильмах снимался раин гослинг. В каких фильмах снимался гослинг. Сколько фильмов поставил альфред хичкок. Сколько картин снял джеймс кэмерон. Сколько кинолент создал джордж лукас. Сколько фильмов в режиссёрской карьере дэвид финчер. Сколько кинопроектов реализовал стивен спилберг. Сколько киноработ выпустил мартин скорсезе. Сколько фильмов выпустил альфред хичкок. Сколько фильмов поставил хичкок. Сколько картин снял кэмерон. Сколько кинолент создал лукас. Сколько фильмов в режиссёрской карьере финчер. Сколько кинопроектов реализовал спилберг. Сколько киноработ выпустил скорсезе. Сколько фильмов выпустил хичкок. К какому жанру относится фильм железная леди. В каком жанре снят фильм убить билла. Какой жанровой категории принадлежит фильм назад в будущее. Каков жанр фильма гарри поттер. К какому жанровому направлению можно отнести фильм молчание ягнят. Какой жанр представлен в фильме список шиндлера. В каком жанре был создан фильм железный человек. В каком жанровом стиле выполнен фильм леон. Какую оценку получил фильм криминальное чтиво. Как критики оценили фильм молчание ягнят. Каков рейтинг фильма назад в будущее. Какой балл у фильма леон. Какой рейтинг присвоен фильму принцесса мононоке. Как зрители оценили фильм красота по-американски. Как оценивается фильм вечное сияние чистого разума. Каковы отзывы о фильме унесенные ветром. В каких ролях снялся актёр гослинг. В каких ролях снялся актёр раин гослинг. В каких фильмах выступал актёр том харди. В каких кинопроектах участвовал актёр харди. В каких кинопроектах участвовал актёр том харди. В каких проектах снимался актёр гослинг. В каких проектах снимался актёр раин гослинг. В каких фильмах можно увидеть актёра леонардо дикаприо. В каких кинолентах принимал участие актёр дикаприо. В каких кинолентах принимал участие актёр леонардо дикаприо. В каких картинах снимался актёр гослинг. В каких фильмах играл актёр раин гослинг. В каких фильмах играл актёр гослинг. Кто создал режиссуру фильма список шиндлера. Кто выступил режиссером фильма список шиндлера. Кто является режиссером фильма робокоп. Кто поставил фильм робокоп. Кто режиссёр фильма назад в будущее. Кто снял фильм фантазер. Кто был ответственным за режиссуру фильма москва слезам не верит. Кто сыграл главную роль в фильме волк с уолл-стрит. Кто является режиссёром фильма интерстеллар. Кто сыграл главную роль в фильме железная леди. Кто снялся в серии фильмов гарри поттер. Кто является режиссёром фильма список шиндлера. Кто сыграл главную роль в фильме белла и бестия. Кто является режиссёром фильма убить билла. Кто снялся в фильме железный человек. Кто рейтинг у фильма железный человек. В каких фильмах снимался дензел вашингтон. В каких фильмах снимался вашингтон. В каких фильмах снимался актер дикаприо. В каких фильмах снимался актер леонардо дикаприо. В каких фильмах снимался раин гослинг. В каких фильмах снимался гослинг. Сколько фильмов поставил альфред хичкок. Сколько картин снял джеймс кэмерон. Сколько кинолент создал джордж лукас. Сколько фильмов в режиссёрской карьере дэвид финчер. Сколько кинопроектов реализовал стивен спилберг. Сколько киноработ выпустил мартин скорсезе. Сколько фильмов выпустил альфред хичкок. Сколько фильмов поставил хичкок. Сколько картин снял кэмерон. Сколько кинолент создал лукас. Сколько фильмов в режиссёрской карьере финчер. Сколько кинопроектов реализовал спилберг. Сколько киноработ выпустил скорсезе. Сколько фильмов выпустил хичкок. К какому жанру относится фильм железная леди. В каком жанре снят фильм убить билла. Какой жанровой категории принадлежит фильм назад в будущее. Каков жанр фильма гарри поттер. К какому жанровому направлению можно отнести фильм молчание ягнят. Какой жанр представлен в фильме список шиндлера. В каком жанре был создан фильм железный человек. В каком жанровом стиле выполнен фильм леон. Какую оценку получил фильм криминальное чтиво. Как критики оценили фильм молчание ягнят. Каков рейтинг фильма назад в будущее. Какой балл у фильма леон. Какой рейтинг присвоен фильму принцесса мононоке. Как зрители оценили фильм красота по-американски. Как оценивается фильм вечное сияние чистого разума. Каковы отзывы о фильме унесенные ветром. В каких ролях снялся актёр гослинг. В каких ролях снялся актёр раин гослинг. В каких фильмах выступал актёр том харди. В каких кинопроектах участвовал актёр харди. В каких кинопроектах участвовал актёр том харди. В каких проектах снимался актёр гослинг. В каких проектах снимался актёр раин гослинг. В каких фильмах можно увидеть актёра леонардо дикаприо. В каких кинолентах принимал участие актёр дикаприо. В каких кинолентах принимал участие актёр леонардо дикаприо. В каких картинах снимался актёр гослинг. В каких фильмах играл актёр раин гослинг. В каких фильмах играл актёр гослинг. Кто создал режиссуру фильма список шиндлера. Кто выступил режиссером фильма список шиндлера. Кто является режиссером фильма робокоп. Кто поставил фильм робокоп. Кто снял фильм фантазер. Кто был ответственным за режиссуру фильма москва слезам не верит. Кто сыграл главную роль в фильме волк с уолл-стрит. Кто является режиссёром фильма интерстеллар. Кто сыграл главную роль в фильме железная леди. Кто снялся в серии фильмов гарри поттер. Кто является режиссёром фильма список шиндлера. Кто сыграл главную роль в фильме белла и бестия. Кто является режиссёром фильма убить билла. Кто снялся в фильме железный человек. Кто рейтинг у фильма железный человек. В каких фильмах снимался дензел вашингтон. В каких фильмах снимался вашингтон. В каких фильмах снимался актер дикаприо. В каких фильмах снимался актер леонардо дикаприо. В каких фильмах снимался раин гослинг. В каких фильмах снимался гослинг. Сколько фильмов поставил альфред хичкок. Сколько картин снял джеймс кэмерон. Сколько кинолент создал джордж лукас. Сколько фильмов в режиссёрской карьере дэвид финчер. Сколько кинопроектов реализовал стивен спилберг. Сколько киноработ выпустил мартин скорсезе. Сколько фильмов выпустил альфред хичкок. Сколько фильмов поставил хичкок. Сколько картин снял кэмерон. Сколько кинолент создал лукас. Сколько фильмов в режиссёрской карьере финчер. Сколько кинопроектов реализовал спилберг. Сколько киноработ выпустил скорсезе. Сколько фильмов выпустил хичкок. К какому жанру относится фильм железная леди. В каком жанре снят фильм убить билла. Какой жанровой категории принадлежит фильм назад в будущее. Каков жанр фильма гарри поттер. К какому жанровому направлению можно отнести фильм молчание ягнят. Какой жанр представлен в фильме список шиндлера. В каком жанре был создан фильм железный человек. В каком жанровом стиле выполнен фильм леон. Какую оценку получил фильм криминальное чтиво. Как критики оценили фильм молчание ягнят. Каков рейтинг фильма назад в будущее. Какой балл у фильма леон. Какой рейтинг присвоен фильму принцесса мононоке. Как зрители оценили фильм красота по-американски. Как оценивается фильм вечное сияние чистого разума. Каковы отзывы о фильме унесенные ветром. В каких ролях снялся актёр гослинг. В каких ролях снялся актёр раин гослинг. В каких фильмах выступал актёр том харди. В каких кинопроектах участвовал актёр харди. В каких кинопроектах участвовал актёр том харди. В каких проектах снимался актёр гослинг. В каких проектах снимался актёр раин гослинг. В каких фильмах можно увидеть актёра леонардо дикаприо. В каких кинолентах принимал участие актёр дикаприо. В каких кинолентах принимал участие актёр леонардо дикаприо. В каких картинах снимался актёр гослинг. В каких фильмах играл актёр раин гослинг. В каких фильмах играл актёр гослинг. Кто создал режиссуру фильма список шиндлера. Кто выступил режиссером фильма список шиндлера. Кто является режиссером фильма робокоп. Кто поставил фильм робокоп. Кто режиссёр фильма назад в будущее. Кто был ответственным за режиссуру фильма москва слезам не верит. Кто сыграл главную роль в фильме волк с уолл-стрит. Кто является режиссёром фильма интерстеллар. Кто сыграл главную роль в фильме железная леди. Кто снялся в серии фильмов гарри поттер. Кто является режиссёром фильма список шиндлера. Кто сыграл главную роль в фильме белла и бестия. Кто является режиссёром фильма убить билла. Кто снялся в фильме железный человек. Кто рейтинг у фильма железный человек. В каких фильмах снимался дензел вашингтон. В каких фильмах снимался вашингтон. В каких фильмах снимался актер дикаприо. В каких фильмах снимался актер леонардо дикаприо. В каких фильмах снимался раин гослинг. В каких фильмах снимался гослинг. Сколько фильмов поставил альфред хичкок. Сколько картин снял джеймс кэмерон. Сколько кинолент создал джордж лукас. Сколько фильмов в режиссёрской карьере дэвид финчер. Сколько кинопроектов реализовал стивен спилберг. Сколько киноработ выпустил мартин скорсезе. Сколько фильмов выпустил альфред хичкок. Сколько фильмов поставил хичкок. Сколько картин снял кэмерон. Сколько кинолент создал лукас. Сколько фильмов в режиссёрской карьере финчер. Сколько кинопроектов реализовал спилберг. Сколько киноработ выпустил скорсезе. Сколько фильмов выпустил хичкок. К какому жанру относится фильм железная леди. В каком жанре снят фильм убить билла. Какой жанровой категории принадлежит фильм назад в будущее. Каков жанр фильма гарри поттер. К какому жанровому направлению можно отнести фильм молчание ягнят. Какой жанр представлен в фильме список шиндлера. В каком жанре был создан фильм железный человек. В каком жанровом стиле выполнен фильм леон. Какую оценку получил фильм криминальное чтиво. Как критики оценили фильм молчание ягнят. Каков рейтинг фильма назад в будущее. Какой балл у фильма леон. Какой рейтинг присвоен фильму принцесса мононоке. Как зрители оценили фильм красота по-американски. Как оценивается фильм вечное сияние чистого разума. Каковы отзывы о фильме унесенные ветром. В каких ролях снялся актёр гослинг. В каких ролях снялся актёр раин гослинг. В каких фильмах выступал актёр том харди. В каких кинопроектах участвовал актёр харди. В каких кинопроектах участвовал актёр том харди. В каких проектах снимался актёр гослинг. В каких проектах снимался актёр раин гослинг. В каких фильмах можно увидеть актёра леонардо дикаприо. В каких кинолентах принимал участие актёр дикаприо. В каких кинолентах принимал участие актёр леонардо дикаприо. В каких картинах снимался актёр гослинг. В каких фильмах играл актёр раин гослинг. В каких фильмах играл актёр гослинг. Кто создал режиссуру фильма список шиндлера. Кто выступил режиссером фильма список шиндлера. Кто является режиссером фильма робокоп. Кто поставил фильм робокоп. Кто снял фильм фантазер. Кто был ответственным за режиссуру фильма москва слезам не верит. Кто сыграл главную роль в фильме волк с уолл-стрит. Кто является режиссёром фильма интерстеллар. Кто сыграл главную роль в фильме железная леди. Кто снялся в серии фильмов гарри поттер. Кто является режиссёром фильма список шиндлера. Кто сыграл главную роль в фильме белла и бестия. Кто является режиссёром фильма убить билла. Кто снялся в фильме железный человек. Кто рейтинг у фильма железный человек. В каких фильмах снимался дензел вашингтон. В каких фильмах снимался вашингтон. В каких фильмах снимался актер дикаприо. В каких фильмах снимался актер леонардо дикаприо.",
        "patterns": [
            {"label": "MOVIE", "pattern": "криминальное чтиво"},
            {"label": "MOVIE", "pattern": "молчание ягнят"},
            {"label": "MOVIE", "pattern": "назад в будущее"},
            {"label": "MOVIE", "pattern": "принцесса мононоке"},
            {"label": "MOVIE", "pattern": "унесенные ветром"},
            {"label": "MOVIE", "pattern": "леон"},
            {"label": "MOVIE", "pattern": "красота по-американски"},
            {"label": "MOVIE", "pattern": "вечное сияние чистого разума"},
            {"label": "ACTOR", "pattern": "харди"},
            {"label": "ACTOR", "pattern": "том харди"},
            {"label": "ACTOR", "pattern": "дикаприо"},
            {"label": "ACTOR", "pattern": "дензел вашингтон"},
            {"label": "ACTOR", "pattern": "вашингтон"},
            {"label": "ACTOR", "pattern": "леонардо дикаприо"},
            {"label": "ACTOR", "pattern": "артур пирожков"},
            {"label": "ACTOR", "pattern": "пирожков"},
            {"label": "ACTOR", "pattern": "гослинг"},
            {"label": "ACTOR", "pattern": "раин гослинг"},
            {"label": "MOVIE", "pattern": "робокоп"},
            {"label": "MOVIE", "pattern": "фантазер"},
            {"label": "MOVIE", "pattern": "москва слезам не верит"},
            {"label": "MOVIE", "pattern": "волк с уолл-стрит"},
            {"label": "MOVIE", "pattern": "интерстеллар"},
            {"label": "MOVIE", "pattern": "железная леди"},
            {"label": "MOVIE", "pattern": "белла и бестия"},
            {"label": "MOVIE", "pattern": "гарри поттер"},
            {"label": "MOVIE", "pattern": "список шиндлера"},
            {"label": "MOVIE", "pattern": "убить билла"},
            {"label": "MOVIE", "pattern": "железный человек"},
            {"label": "DIRECTOR", "pattern": "спилберг"},
            {"label": "DIRECTOR", "pattern": "стивен спилберг"},
            {"label": "DIRECTOR", "pattern": "альфред хичкок"},
            {"label": "DIRECTOR", "pattern": "джеймс кэмерон"},
            {"label": "DIRECTOR", "pattern": "джордж лукас"},
            {"label": "DIRECTOR", "pattern": "дэвид финчер"},
            {"label": "DIRECTOR", "pattern": "мартин скорсезе"},
            {"label": "DIRECTOR", "pattern": "хичкок"},
            {"label": "DIRECTOR", "pattern": "кэмерон"},
            {"label": "DIRECTOR", "pattern": "лукас"},
            {"label": "DIRECTOR", "pattern": "финчер"},
            {"label": "DIRECTOR", "pattern": "скорсезе"}
        ]
    },
    "valid": {
        "text": "В каких фильмах снимался актер джонсон. В каких фильмах снимался актер брэд питт. Сколько фильмов поставил кристофер нолан. Сколько картин снял роберт земекис. Сколько кинолент создал квентин тарантино. Сколько фильмов в режиссёрской карьере дэвид финчер. Сколько кинопроектов реализовал стивен спилберг. Сколько киноработ выпустил мартин скорсезе. Сколько фильмов выпустил кристофер нолан. Сколько фильмов поставил хичкок. Сколько картин снял кэмерон. Сколько кинолент создал лукас. Сколько фильмов в режиссёрской карьере финчер. Сколько кинопроектов реализовал спилберг. Сколько киноработ выпустил скорсезе. Сколько фильмов выпустил хичкок. К какому жанру относится фильм кочегар. В каком жанре снят фильм убить билла. Какой жанровой категории принадлежит фильм артист. Каков жанр фильма гарри поттер. К какому жанровому направлению можно отнести фильм выживший. Какой жанр представлен в фильме список шиндлера. В каком жанре был создан фильм железный человек. В каком жанровом стиле выполнен фильм шепот сердца. Какую оценку получил фильм бешеный бык. Как критики оценили фильм выживший. Каков рейтинг фильма артист. Какой балл у фильма шепот сердца. Какой рейтинг присвоен фильму призрак в доспехах. Как зрители оценили фильм гладиатор. Как оценивается фильм симеон-пустынник. Каковы отзывы о фильме ирландец. В каких ролях снялся актёр гослинг. В каких ролях снялся актёр брэд питт. В каких фильмах выступал актёр том круз. В каких кинопроектах участвовал актёр круз. В каких кинопроектах участвовал актёр том круз. В каких проектах снимался актёр гослинг. В каких проектах снимался актёр брэд питт. В каких фильмах можно увидеть актёра дуэйн джонсон. В каких кинолентах принимал участие актёр джонсон. В каких кинолентах принимал участие актёр дуэйн джонсон. В каких картинах снимался актёр гослинг. В каких фильмах играл актёр брэд питт. В каких фильмах играл актёр гослинг. Кто создал режиссуру фильма список шиндлера. Кто выступил режиссером фильма список шиндлера. Кто является режиссером фильма мастер. Кто поставил фильм мастер. Кто снял фильм меланхолия. Кто был ответственным за режиссуру фильма москва слезам не верит. Кто сыграл главную роль в фильме волк с уолл-стрит. Кто является режиссёром фильма степной волк. Кто сыграл главную роль в фильме кочегар. Кто снялся в серии фильмов гарри поттер. Кто является режиссёром фильма список шиндлера. Кто сыграл главную роль в фильме белла и бестия. Кто является режиссёром фильма убить билла. Кто снялся в фильме железный человек. Кто рейтинг у фильма железный человек.",
        "patterns": [
            {"label": "MOVIE", "pattern": "бешеный бык"},
            {"label": "MOVIE", "pattern": "выживший"},
            {"label": "MOVIE", "pattern": "артист"},
            {"label": "MOVIE", "pattern": "призрак в доспехах"},
            {"label": "MOVIE", "pattern": "ирландец"},
            {"label": "MOVIE", "pattern": "шепот сердца"},
            {"label": "MOVIE", "pattern": "гладиатор"},
            {"label": "MOVIE", "pattern": "симеон-пустынник"},
            {"label": "ACTOR", "pattern": "круз"},
            {"label": "ACTOR", "pattern": "том круз"},
            {"label": "ACTOR", "pattern": "джонсон"},
            {"label": "ACTOR", "pattern": "дуэйн джонсон"},
            {"label": "ACTOR", "pattern": "гослинг"},
            {"label": "ACTOR", "pattern": "брэд питт"},
            {"label": "MOVIE", "pattern": "мастер"},
            {"label": "MOVIE", "pattern": "меланхолия"},
            {"label": "MOVIE", "pattern": "москва слезам не верит"},
            {"label": "MOVIE", "pattern": "волк с уолл-стрит"},
            {"label": "MOVIE", "pattern": "степной волк"},
            {"label": "MOVIE", "pattern": "кочегар"},
            {"label": "MOVIE", "pattern": "гарри поттер"},
            {"label": "MOVIE", "pattern": "список шиндлера"},
            {"label": "MOVIE", "pattern": "убить билла"},
            {"label": "MOVIE", "pattern": "железный человек"},
            {"label": "DIRECTOR", "pattern": "спилберг"},
            {"label": "DIRECTOR", "pattern": "стивен спилберг"},
            {"label": "DIRECTOR", "pattern": "кристофер нолан"},
            {"label": "DIRECTOR", "pattern": "роберт земекис"},
            {"label": "DIRECTOR", "pattern": "квентин тарантино"},
            {"label": "DIRECTOR", "pattern": "дэвид финчер"},
            {"label": "DIRECTOR", "pattern": "мартин скорсезе"},
            {"label": "DIRECTOR", "pattern": "хичкок"},
            {"label": "DIRECTOR", "pattern": "кэмерон"},
            {"label": "DIRECTOR", "pattern": "лукас"},
            {"label": "DIRECTOR", "pattern": "финчер"},
            {"label": "DIRECTOR", "pattern": "скорсезе"}
        ]
    }
}



